### Importing Pandas Libraries

In [1]:
import pandas as pd
pd.__version__

'0.22.0'

### Creating Series object 
A pandas series object is used to create dataframes as shown below.

In [2]:
pd.Series(['San Francisco', 'San Jose', 'Sacramento'])

0    San Francisco
1         San Jose
2       Sacramento
dtype: object

In [3]:
city_names = pd.Series(['San Francisco', 'San Jose', 'Sacramento'])
population = pd.Series([852469, 1015785, 485199])

pd.DataFrame({ 'City name': city_names, 'Population': population })

       City name  Population
0  San Francisco      852469
1       San Jose     1015785
2     Sacramento      485199

### Working with california housing dataset.
The read_csv function reads a CSV file and converts it into a dataset.

In [4]:
california_housing_dataframe = pd.read_csv("https://storage.googleapis.com/mledu-datasets/california_housing_train.csv", sep=",")
california_housing_dataframe.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000,17000.000000
mean,-119.562108,35.625225,28.589353,2643.664412,539.410824,1429.573941,501.221941,3.883578,207300.912353
std,2.005166,2.137340,12.586937,2179.947071,421.499452,1147.852959,384.520841,1.908157,115983.764387
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000
25%,-121.790000,33.930000,18.000000,1462.000000,297.000000,790.000000,282.000000,2.566375,119400.000000
50%,-118.490000,34.250000,29.000000,2127.000000,434.000000,1167.000000,409.000000,3.544600,180400.000000
75%,-118.000000,37.720000,37.000000,3151.250000,648.250000,1721.000000,605.250000,4.767000,265000.000000
max,-114.310000,41.950000,52.000000,37937.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000

In [5]:
california_housing_dataframe.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-114.31,34.19,15.0,5612.0,1283.0,1015.0,472.0,1.4936,66900.0
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
4,-114.57,33.57,20.0,1454.0,326.0,624.0,262.0,1.9250,65500.0

In [6]:
hist1 = california_housing_dataframe.hist('housing_median_age')
hist1

array([[<matplotlib.axes._subplots.AxesSubplot object at 0x000001527F0E73C8>]],
      dtype=object)

### Using numpy for basic arithmetic computations
Series objects in Pandas can work with Numpy

In [7]:
import numpy as np

In [8]:
np.log(population)

0    13.655892
1    13.831172
2    13.092314
dtype: float64

In [9]:
california_housing_dataframe.housing_median_age.apply(lambda val: val > 27)

0        False
1        False
2        False
3        False
4        False
5         True
6        False
7         True
8         True
9         True
10       False
11       False
12        True
13        True
14       False
15       False
16        True
17       False
18       False
19       False
20       False
21       False
22       False
23       False
24       False
25        True
26        True
27       False
28        True
29       False
         ...
16970     True
16971     True
16972     True
16973     True
16974     True
16975    False
16976    False
16977     True
16978     True
16979     True
16980     True
16981     True
16982     True
16983    False
16984     True
16985     True
16986    False
16987    False
16988    False
16989     True
16990     True
16991    False
16992     True
16993     True
16994     True
16995     True
16996     True
16997    False
16998    False
16999     True
Name: housing_median_age, Length: 17000, dtype: bool